namespace islamyTester;

public class UnitTest1
{
    [Fact]
    public void ShortenTest()
    {
        string shrt = Program.ShortenArabicHadtih(@"حدثنا معاذ بن اسد، اخبرنا عبد الله، اخبرنا معمر، عن همام بن منبه، عن ابي هريرة رضى الله عنه عن النبي صلى الله عليه وسلم قال""قال الله اعددت لعبادي الصالحين ما لا عين رات، ولا اذن سمعت، ولا خطر على قلب بشر""");

        Assert.Equal("عن ابي هريرة رضى الله عنه عن النبي صلى الله عليه وسلم قال\"قال الله اعددت لعبادي الصالحين ما لا عين رات، ولا اذن سمعت، ولا خطر على قلب بشر\"", shrt);
    }
}